{
  "_name_or_path": "CAMeL-Lab/arabart-qalb15-gec-ged-13",
  "activation_dropout": 0.1,
  "activation_function": "gelu",
  "add_bias_logits": false,
  "add_final_layer_norm": true,
  "architectures": [
    "MBartForConditionalGeneration"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": 0,
  "classif_dropout": 0.1,
  "classifier_dropout": 0.0,
  "d_model": 768,
  "decoder_attention_heads": 12,
  "decoder_ffn_dim": 3072,
  "decoder_layerdrop": 0.0,
  "decoder_layers": 6,
  "decoder_start_token_id": 2,
  "do_blenderbot_90_layernorm": false,
  "dropout": 0.1,
  "early_stopping": true,
  "encoder_attention_heads": 12,
  "encoder_ffn_dim": 3072,
  "encoder_layerdrop": 0.0,
  "encoder_layers": 6,
  "eos_token_id": 2,
  "extra_pos_embeddings": 2,
  "force_bos_token_to_be_generated": false,
  "forced_eos_token_id": 2,
  "ged_id2label": {
    "0": "<pad>",
    "1": "DELETE",
    "10": "REPLACE_X",
    "11": "SPLIT",
    "12": "UC",
    "2": "MERGE-B",
    "3": "MERGE-I",
    "4": "REPLACE_M",
    "5": "REPLACE_M+REPLACE_O",
    "6": "REPLACE_O",
    "7": "REPLACE_O+REPLACE_X",
    "8": "REPLACE_P",
    "9": "REPLACE_S"
  },
  "ged_label2id": {
    "<pad>": 0,
    "DELETE": 1,
    "MERGE-B": 2,
    "MERGE-I": 3,
    "REPLACE_M": 4,
    "REPLACE_M+REPLACE_O": 5,
    "REPLACE_O": 6,
    "REPLACE_O+REPLACE_X": 7,
    "REPLACE_P": 8,
    "REPLACE_S": 9,
    "REPLACE_X": 10,
    "SPLIT": 11,
    "UC": 12
  },
  "ged_num_labels": 13,
  "gradient_checkpointing": false,
  "id2label": {
    "0": "LABEL_0",
    "1": "LABEL_1",
    "2": "LABEL_2"
  },
  "init_std": 0.02,
  "is_encoder_decoder": true,
  "label2id": {
    "LABEL_0": 0,
    "LABEL_1": 1,
    "LABEL_2": 2
  },
  "max_position_embeddings": 1024,
  "model_type": "mbart",
  "no_repeat_ngram_size": 3,
  "normalize_before": true,
  "normalize_embedding": true,
  "num_beams": 4,
  "num_hidden_layers": 6,
  "pad_token_id": 1,
  "scale_embedding": false,
  "static_position_embeddings": false,
  "tokenizer_class": "BarthezTokenizer",
  "torch_dtype": "float32",
  "transformers_version": "4.43.4",
  "use_cache": true,
  "vocab_size": 50002
}
